CSI API ETABS v1
cAreaObj.DeleteLoadUniform Method
 Deletes the uniform load assignments to the specified area objects for the specified load pattern.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int DeleteLoadUniform(
	string Name,
	string LoadPat,
	eItemType ItemType = eItemType.Objects
)
Function DeleteLoadUniform (
	Name As String,
	LoadPat As String,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim LoadPat As String
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.DeleteLoadUniform(Name,
	LoadPat, ItemType)
int DeleteLoadUniform(
	String^ Name,
	String^ LoadPat,
	eItemType ItemType = eItemType::Objects
)
abstract DeleteLoadUniform :
        Name : string *
        LoadPat : string *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing area object or group, depending on the value of the ItemType item.
LoadPat
Type: System.String
 The name of a defined load pattern.
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the load assignments are deleted for the area object specified by the Name item.
 If this item is Group, the load assignments are deleted for all area objects in the group specified by the Name item.
 If this item is SelectedObjects, the load assignments are deleted for all selected area objects, and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the load assignments are successfully deleted, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'assign area object uniform loads
   ret = SapModel.AreaObj.SetLoadUniform("ALL", "DEAD", -0.01, 2, False, "Local", eItemType.Group)
'delete area object uniform load
   ret = SapModel.AreaObj.DeleteLoadUniform("3", "DEAD")
'refresh view
   ret = SapModel.View.RefreshView(0, False)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace